import re

txt = ("Добрый день\n"
    "Сегодня на выезды потребуется отправить трёх-четырёх специалистов, остальных держите в офисе.\n"
       "Некоторые заявки пришли на конкретных людей, но можно вызвать и других, смотрите по ситуации,\n"
       "как лучше их отправить, чтобы всех объездить сегодня.\n"
    "Петрову П. П. попросили выехать по адресам ул. Культуры 78 кв. 6, улица Мира дом 12Б квартира 144.\n"
       "Смирнова С. С. просят подъехать только по адресу: Восьмого Марта 106-19.\n"
       "Без предпочтений по специалистам пришли запросы с адресов: улица Свободы 54 6,\n"
       "Улица Шишкина дом 9 кв. 15, ул. Лермонтова 18 кв. 93.\n"
    "Все адреса скопированы из заявок, корректность подтверждена.")

txt = re.sub("улица|Улица|по адресу:", "ул.", txt)
txt = re.sub("дом|квартира|кв.", "", txt)
txt = re.sub("-", " ", txt)

new_txt = re.findall(r"ул\.\s*\D*\s*\d*\w*\s*\d*", txt)

# первый вариант
for i in range(len(new_txt)):
    print((" ".join([i for i in new_txt[i].split(" ")] [0:-1]) + " - " + new_txt[i].split(" ")[-1]).replace("  ", " "))

# наверно так будет легче читать
# for address in new_txt:
#     str = address.split()
#     ulica = " ".join(str[:-2]).strip()
#     # ulica = " ".join(str[1:-2]).strip() # если нужно убрать "ул."
#     dom = str[-2]
#     kvartira = str[-1]
#     res = f"{ulica} {dom}-{kvartira}"
#     print(res)